name = input('Здравствуйте! Как Вас зовут?')
print(f"Очень приятно, {name}! Меня зовут Марк.")
vp = int(input('Сколько Вам лет?'))
vr = 78
if vp < vr:
    d = vr - vp
    print(f"Да, {name}, я старше Вас на {d} лет.")
elif vp > vr:
    d = vp - vr
    print(f"Да, {name}, Вы старше меня на {d} лет.")
else:
    print(f"Да,{name}, мы с Вами ровесники")
ans = input('Вам нравится программировать?')
if ans == 'да':
    print('Превосходно! Уверен, у Вас получится написать множество полезных и хороших программ.')
else:
    print('Жаль. Я думал, Вы сможете написать интересную программу для меня.')