a = input('Собака короткошерстной породы?')
if a == 'да':
    a1 = input('Рост собаки менее 50 см?')
    if a1 == 'да':
        a2 = input('У собаки короткий хвост?')
        if a2 == 'да':
            print('английский бульдог')
        else:
            a3 = input('У собаки длинные уши?')
            if a3 == 'да':
                print('гончая')
            else:
                a4 = input('У собаки короткое тело?')
                if a4 == 'да':
                    print('мопс')
                else:
                    print('чихуахуа')
    else:
        a5 = input('Собака весит больше 50 кг?')
        if a5 == 'да':
            print('датский дог')
        else:
            print('фоксхаунд')

else:
    b = input('Рост собаки менее 50 см?')
    if b == 'да':
        b1 = input('У собаки доброжелательный характер?')
        if b1 == 'да':
            print('кокер-спаниэль')
        else:
            print('ирландский сеттер')
    else:
        b2 = input('У собаки рост менее 70 см?')
        if b2 == 'да':
            b3 = input('У собаки длинные уши?')
            if b3 == 'да':
                print('большой вандейский грифон')
            else:
                print('колли')
        else:
            b4 = input('Окрас рыжий с белыми отметинами?')
            if b4 == 'да':
                print('сенбернар')
            else:
                b5 = input('Белоснежный окрас?')
                if b5 == 'да':
                    print('ирландский волкодав')
                else:
                    print('ньюфаундлер')



